#### Terraform Format and Style 🖌`success`
#### hca - Terraform Initialization ⚙️`success`
#### hca - Terraform Validation 🤖Success! The configuration is valid.


#### hca - Terraform Plan 📖`success`

<details><summary>hca - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_dns_managed_zone.dev_zone: Refreshing state...
module.ebi_staging_notification_pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/topics/broad-dsp-monster-hca-dev.staging-transfer-notifications.ebi]
module.ebi_staging_notification_pubsub_topic.data.google_project.project: Refreshing state...
module.cloudsql.random_id.cloudsql_random_id: Refreshing state... [id=xC_nAuvmM8k]
module.cloudsql.random_id.db_password["argo"]: Refreshing state... [id=rJIvaqIiGO7JRzjluWcq_Q]
module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription.pull_subscriptions[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/subscriptions/ebi-writer]
module.hca_gke_runner_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
data.google_project.current_project: Refreshing state...
module.hca_argo_runner_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_test_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_dataflow_account.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket.hca_argo_archive: Refreshing state... [id=broad-dsp-monster-hca-dev-argo-archive]
data.google_storage_transfer_project_service_account.sts_account: Refreshing state...
module.enable_services.google_project_service.service_usage: Refreshing state... [id=broad-dsp-monster-hca-dev/serviceusage.googleapis.com]
google_storage_bucket.temp_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-temp-storage]
module.enable_services.google_project_service.cloud_resource_manager: Refreshing state... [id=broad-dsp-monster-hca-dev/cloudresourcemanager.googleapis.com]
google_storage_bucket.ebi_staging_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-ebi-staging]
google_storage_bucket.staging_storage: Refreshing state... [id=broad-dsp-monster-hca-dev-staging-storage]
google_storage_bucket.logs: Refreshing state... [id=broad-dsp-monster-hca-dev-error-logs]
google_storage_bucket.test_bucket: Refreshing state... [id=broad-dsp-monster-hca-dev-test-storage]
module.master.data.google_project.project: Refreshing state...
module.hca_argo_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/9c5a663985dffb57959433ab05a3db0df190f204]
module.hca_argo_runner_account.null_resource.sa_delay: Refreshing state... [id=3177923860552428035]
module.ebi_writer_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/0528cc1efbaa8f9eb2f4ca1c9172b9001fc919b8]
module.hca_gke_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/5c35babda61168faf63fad119c72ada487352651]
module.hca_gke_runner_account.null_resource.sa_delay: Refreshing state... [id=6954302391853138953]
module.ebi_writer_account.null_resource.sa_delay: Refreshing state... [id=1217901908648473952]
module.hca_test_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/1d445d25a746dab0d0fa32a66b843a984d120d2d]
module.hca_test_account.null_resource.sa_delay: Refreshing state... [id=9134575832749528464]
module.hca_dataflow_account.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/aa08ddd831b5996403cc321f38d76be1ca75152b]
module.hca_dataflow_account.null_resource.sa_delay: Refreshing state... [id=7118201721842306920]
module.ebi_staging_notification_pubsub_topic.google_pubsub_topic_iam_member.pull_topic_binding[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/topics/broad-dsp-monster-hca-dev.staging-transfer-notifications.ebi/roles/pubsub.publisher/serviceaccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com]
module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription_iam_member.pull_subscription_binding[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/subscriptions/ebi-writer/roles/pubsub.subscriber/serviceaccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com]
module.ebi_staging_notification_pubsub_topic.google_project_iam_member.token_creator_binding[0]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/iam.serviceAccountTokenCreator/serviceaccount:service-104615930137@gcp-sa-pubsub.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_user_bucket_iam["enrique@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.admin/user:enrique@ebi.ac.uk]
google_storage_bucket_iam_member.ebi_user_bucket_iam["rolando@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.admin/user:rolando@ebi.ac.uk]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketReader"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.legacyBucketReader/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketWriter"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.legacyBucketWriter/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.objectViewer"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:project-104615930137@storage-transfer-service.iam.gserviceaccount.com]
google_service_account_iam_binding.hca_workload_identity_binding: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_storage_bucket_iam_member.hca_argo_temp_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_account_iam_reader: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["dataflow.developer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.developer/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_logs_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-argo-archive/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/bigquery.dataOwner/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/bigquery.jobUser/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["compute.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/compute.viewer/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_staging_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.admin/serviceaccount:hca-argo-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_logging_project_sink.bucket-log-sink: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/sinks/broad-dsp-monster-hca-dev-gcs-log-sink]
google_service_account_iam_binding.dataflow_runner_user_binding: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/monitoring.viewer/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["logging.logWriter"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/logging.logWriter/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.metricWriter"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/monitoring.metricWriter/serviceaccount:hca-gke-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.ebi_writer_iam: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/topics/broad-dsp-monster-hca-dev.staging-transfer-notifications.ebi/roles/pubsub.publisher/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.viewer"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/storagetransfer.viewer/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_writer_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectAdmin/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_pubsub_subscription_iam_member.ebi_writer_iam: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/subscriptions/ebi-writer/roles/pubsub.subscriber/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.user"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/storagetransfer.user/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_test_account.google_project_iam_member.sa_iam["dataflow.admin"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_test_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.worker/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_dataflow_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/dataflow.worker/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_reader_iam["hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-dev-ebi-staging/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.hca_gke_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/gke-runner]
module.hca_argo_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-argo-runner]
module.cloudsql.vault_generic_secret.postgres_user["argo"]: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/cloudsql/users/argo]
module.hca_dataflow_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-dataflow-runner]
module.ebi_writer_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/ebi-storage-writer]
module.hca_test_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/hca-test-runner]
google_storage_bucket_iam_member.bucket-log-writer: Refreshing state... [id=b/broad-dsp-monster-hca-dev-error-logs/roles/storage.objectCreator/serviceaccount:p104615930137-443008@gcp-sa-logging.iam.gserviceaccount.com]
google_storage_bucket_iam_member.test_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-test-storage/roles/storage.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.temp_bucket_test_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-test-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-staging-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.temp_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-dev-temp-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.enable_services.google_project_service.services[18]: Refreshing state... [id=broad-dsp-monster-hca-dev/storagetransfer.googleapis.com]
module.enable_services.google_project_service.services[3]: Refreshing state... [id=broad-dsp-monster-hca-dev/dns.googleapis.com]
module.enable_services.google_project_service.services[13]: Refreshing state... [id=broad-dsp-monster-hca-dev/sql-component.googleapis.com]
module.enable_services.google_project_service.services[4]: Refreshing state... [id=broad-dsp-monster-hca-dev/iam.googleapis.com]
module.enable_services.google_project_service.services[10]: Refreshing state... [id=broad-dsp-monster-hca-dev/resourceviews.googleapis.com]
module.enable_services.google_project_service.services[5]: Refreshing state... [id=broad-dsp-monster-hca-dev/iamcredentials.googleapis.com]
module.enable_services.google_project_service.services[16]: Refreshing state... [id=broad-dsp-monster-hca-dev/storage-component.googleapis.com]
module.enable_services.google_project_service.services[15]: Refreshing state... [id=broad-dsp-monster-hca-dev/storage-api.googleapis.com]
module.enable_services.google_project_service.services[7]: Refreshing state... [id=broad-dsp-monster-hca-dev/monitoring.googleapis.com]
module.enable_services.google_project_service.services[11]: Refreshing state... [id=broad-dsp-monster-hca-dev/runtimeconfig.googleapis.com]
module.enable_services.google_project_service.services[8]: Refreshing state... [id=broad-dsp-monster-hca-dev/replicapool.googleapis.com]
module.enable_services.google_project_service.services[14]: Refreshing state... [id=broad-dsp-monster-hca-dev/stackdriver.googleapis.com]
module.enable_services.google_project_service.services[9]: Refreshing state... [id=broad-dsp-monster-hca-dev/replicapoolupdater.googleapis.com]
module.enable_services.google_project_service.services[2]: Refreshing state... [id=broad-dsp-monster-hca-dev/containerregistry.googleapis.com]
module.enable_services.google_project_service.services[19]: Refreshing state... [id=broad-dsp-monster-hca-dev/pubsub.googleapis.com]
module.enable_services.google_project_service.services[1]: Refreshing state... [id=broad-dsp-monster-hca-dev/container.googleapis.com]
module.enable_services.google_project_service.services[6]: Refreshing state... [id=broad-dsp-monster-hca-dev/logging.googleapis.com]
module.enable_services.google_project_service.services[12]: Refreshing state... [id=broad-dsp-monster-hca-dev/sqladmin.googleapis.com]
module.enable_services.google_project_service.services[17]: Refreshing state... [id=broad-dsp-monster-hca-dev/dataflow.googleapis.com]
module.enable_services.google_project_service.services[0]: Refreshing state... [id=broad-dsp-monster-hca-dev/compute.googleapis.com]
module.k8s_network.google_compute_address.nat_addresses[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/addresses/hca-network-nat-0]
module.k8s_network.google_compute_address.nat_addresses[1]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/addresses/hca-network-nat-1]
module.cloudsql.module.proxy_sa.google_service_account.sa: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.k8s_network.google_compute_network.network: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/networks/hca-network]
module.dns_names.google_compute_global_address.global_ip_address["hca-argo"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/addresses/hca-argo-ip]
module.dns_names.google_compute_global_address.global_ip_address["hca-argocd"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/addresses/hca-argocd-ip]
module.cloudsql.google_sql_database_instance.postgres: Refreshing state... [id=command-center-postgres-c42fe702ebe633c9]
module.dns_names.google_compute_global_address.global_ip_address["hca-grafana"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/global/addresses/hca-grafana-ip]
module.cloudsql.vault_generic_secret.postgres_connection_name: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/cloudsql/instance]
module.cloudsql.google_sql_user.db_user["argo"]: Refreshing state... [id=argo//command-center-postgres-c42fe702ebe633c9]
module.cloudsql.module.proxy_sa.null_resource.sa_delay: Refreshing state... [id=5633320881387768952]
module.cloudsql.module.proxy_sa.google_service_account_key.sa_key: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/serviceAccounts/command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com/keys/74eeb507111986ec37c079db088f58f725e52c98]
module.cloudsql.module.proxy_sa.google_project_iam_member.sa_iam["cloudsql.client"]: Refreshing state... [id=broad-dsp-monster-hca-dev/roles/cloudsql.client/serviceaccount:command-center-proxy-runner@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
module.k8s_network.google_compute_router.router: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/routers/hca-network-router]
module.k8s_network.google_compute_subnetwork.subnetworks[0]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/regions/us-central1/subnetworks/hca-network]
module.cloudsql.module.proxy_sa.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/service-accounts/command-center-proxy-runner]
module.dns_names.google_dns_record_set.a_dns["hca-argo"]: Refreshing state... [id=monster-dev/hca-argo-global.monster-dev.broadinstitute.org./A]
module.dns_names.google_dns_record_set.a_dns["hca-argocd"]: Refreshing state... [id=monster-dev/hca-argocd-global.monster-dev.broadinstitute.org./A]
module.dns_names.google_dns_record_set.a_dns["hca-grafana"]: Refreshing state... [id=monster-dev/hca-grafana-global.monster-dev.broadinstitute.org./A]
module.dns_names.google_dns_record_set.cname_dns["hca-argocd"]: Refreshing state... [id=monster-dev/hca-argocd.monster-dev.broadinstitute.org./CNAME]
module.dns_names.google_dns_record_set.cname_dns["hca-grafana"]: Refreshing state... [id=monster-dev/hca-grafana.monster-dev.broadinstitute.org./CNAME]
module.dns_names.google_dns_record_set.cname_dns["hca-argo"]: Refreshing state... [id=monster-dev/hca-argo.monster-dev.broadinstitute.org./CNAME]
module.k8s_network.google_compute_router_nat.nat: Refreshing state... [id=broad-dsp-monster-hca-dev/us-central1/hca-network-router/hca-network-nat]
module.master.google_container_cluster.master: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/locations/us-central1-c/clusters/hca-cluster]
module.master.vault_generic_secret.master_secrets: Refreshing state... [id=secret/dsde/monster/dev/ingest/hca/gke]
module.node_pool.google_container_node_pool.pool: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/locations/us-central1-c/clusters/hca-cluster/nodePools/hca-node-pool]
module.cloudsql.google_sql_database.db["argo"]: Refreshing state... [id=projects/broad-dsp-monster-hca-dev/instances/command-center-postgres-c42fe702ebe633c9/databases/argo]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account_iam_binding.hca_dagster_workload_identity_binding will be created
  + resource "google_service_account_iam_binding" "hca_dagster_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:broad-dsp-monster-hca-dev.svc.id.goog[dagster/monster-dagster]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.jobUser"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["compute.viewer"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.viewer"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["dataflow.developer"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dataflow.developer"
    }

  # module.hca_dagster_runner_account.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "hca-dagster-runner"
      + display_name = "Service account to run HCA's Dagster pipelines."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.hca_dagster_runner_account.google_service_account_key.sa_key will be created
  + resource "google_service_account_key" "sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.hca_dagster_runner_account.null_resource.sa_delay will be created
  + resource "null_resource" "sa_delay" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.hca_dagster_runner_account.vault_generic_secret.sa_secret will be created
  + resource "vault_generic_secret" "sa_secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/monster/dev/ingest/hca/service-accounts/hca-dagster-runner"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @ThePletch, Action: `pull_request`, Working Directory: `/home/runner/work/monster-deploy/monster-deploy/environments/hca/terraform`, Workflow: `Terraform Plan`*